// 별찍기

// *
// **
// ***
// ****
// *****

for (i = 1; i <= 5; i++) {
    console.log('*'.repeat(i));
}

console.log('----------------------------------')

// *****
// ****
// ***
// **
// *

for (j=5; j>0; j--){
    console.log('*'.repeat(j));
}

console.log('----------------------------------')


//     *
//    **
//   ***
//  ****
// *****

for (k=1; k <=5; k++) {
    console.log(' '.repeat(5-k) + '*'.repeat(k))
}

console.log('----------------------------------')

// *****
//  ****
//   ***
//    **
//     *

for (l=0; l < 5 ; l++) {
    console.log(' '.repeat(l) + '*'.repeat(5-l))
}

console.log('----------------------------------')

//    *
//   ***
//  *****
// *******
//*********

// 별은
// 0번째줄에 1개   2n+1
// 1번째줄에 3개   2n+1
// 2번째줄에 5개.. 2n+1
// 3번째줄에 7개   2n+1
// 4번째줄에 9개   2n+1

// 공백은
// 0번째줄에 4개
// 1번째줄에 3개
// 2번째줄에 2개
// 3번째줄에 1개
// 4번째줄에 0개

for(m=0; m < 5; m++) {
    console.log(' '.repeat(5-1-m) + '*'.repeat(2*m+1))
}